content/index.org
#+TITLE: Example Site
* Welcome to My Org Page
Welcome to this simple web-like page in an Emacs Org file. You can navigate using the sections below.

* About
This is an example of how an Org file can be structured like a web page. Org mode allows for rich formatting and easy exporting to HTML.

* Features

** Headings for structuring content

** Links for navigation

** Lists for organizing information

** Images and tables for added detail

* Contact
For more information, reach out at: [[mailto:your-email@example.com][your-email@example.com]].

* Footer
Thank you for visiting this Org page!
