public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Example Site</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Example Site</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6f0dfea">Welcome to My Org Page</a></li>
<li><a href="#org28056ab">About</a></li>
<li><a href="#org45dc24c">Features</a>
<ul>
<li><a href="#org09fa919">Headings for structuring content</a></li>
<li><a href="#org5a545e4">Links for navigation</a></li>
<li><a href="#orgced191b">Lists for organizing information</a></li>
<li><a href="#orge933a62">Images and tables for added detail</a></li>
</ul>
</li>
<li><a href="#org2f98909">Contact</a></li>
<li><a href="#org19d21df">Footer</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6f0dfea" class="outline-2">
<h2 id="org6f0dfea">Welcome to My Org Page</h2>
<div class="outline-text-2" id="text-org6f0dfea">
<p>
Welcome to this simple web-like page in an Emacs Org file. You can navigate using the sections below.
</p>
</div>
</div>
<div id="outline-container-org28056ab" class="outline-2">
<h2 id="org28056ab">About</h2>
<div class="outline-text-2" id="text-org28056ab">
<p>
This is an example of how an Org file can be structured like a web page. Org mode allows for rich formatting and easy exporting to HTML.
</p>
</div>
</div>
<div id="outline-container-org45dc24c" class="outline-2">
<h2 id="org45dc24c">Features</h2>
<div class="outline-text-2" id="text-org45dc24c">
</div>
<div id="outline-container-org09fa919" class="outline-3">
<h3 id="org09fa919">Headings for structuring content</h3>
</div>

<div id="outline-container-org5a545e4" class="outline-3">
<h3 id="org5a545e4">Links for navigation</h3>
</div>

<div id="outline-container-orgced191b" class="outline-3">
<h3 id="orgced191b">Lists for organizing information</h3>
</div>

<div id="outline-container-orge933a62" class="outline-3">
<h3 id="orge933a62">Images and tables for added detail</h3>
</div>
</div>
<div id="outline-container-org2f98909" class="outline-2">
<h2 id="org2f98909">Contact</h2>
<div class="outline-text-2" id="text-org2f98909">
<p>
For more information, reach out at: <a href="mailto:your-email@example.com">your-email@example.com</a>.
</p>
</div>
</div>
<div id="outline-container-org19d21df" class="outline-2">
<h2 id="org19d21df">Footer</h2>
<div class="outline-text-2" id="text-org19d21df">
<p>
Thank you for visiting this Org page!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
